IDENTIFICATION DIVISION.
PROGRAM-ID. ROMANNUMERALS.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT STANDARD-INPUT ASSIGN TO KEYBOARD.
    SELECT STANDARD-OUTPUT ASSIGN TO DISPLAY.

DATA DIVISION.
FILE SECTION.
FD STANDARD-INPUT.
    01 STDIN-RECORD PICTURE X(80).
FD STANDARD-OUTPUT.
    01 STDOUT-RECORD PICTURE X(80).

WORKING-STORAGE SECTION.
77  EOF PICTURE 9 VALUE 0.

77  ROMAN-LEN PICTURE S99 USAGE IS COMPUTATIONAL.
77  ERR PICTURE S9 USAGE IS COMPUTATIONAL-3.
77  RESULT PICTURE S9(8) USAGE IS COMPUTATIONAL.
01  ROMAN.
    02 S PICTURE X(1) OCCURS 30 TIMES.

01 ERROR-MSG.
    02 FILLER PICTURE X(1) VALUE SPACE.
    02 FILLER PICTURE X(22) VALUE 'ILLEGAL ROMAN NUMERAL'.
    02 FILLER PICTURE X(1) VALUE SPACE.
    02 ERROR-VAL PICTURE X(30).

01  TITLE-LINE.
    02 FILLER PICTURE X(11) VALUE SPACES.
    02 FILLER PICTURE X(24) VALUE 'ROMAN NUMBER EQUIVALENTS'.

01  UNDERLINE-1.
    02 FILLER PICTURE X(45) VALUE 
       ' --------------------------------------------'.

01  COL-HEADS.
    02 FILLER PICTURE X(9) VALUE SPACES.
    02 FILLER PICTURE X(12) VALUE 'ROMAN NUMBER'.
    02 FILLER PICTURE X(13) VALUE SPACES.
    02 FILLER PICTURE X(11) VALUE 'DEC. EQUIV.'.

01  UNDERLINE-2.
    02 FILLER PICTURE X(45) VALUE
       ' ------------------------------   -----------'.

01  PRINT-LINE.
    02 FILLER PICTURE X VALUE SPACE.
    02 OUT-R  PICTURE X(30).
    02 FILLER PICTURE X(3) VALUE SPACES.
    02 OUT-EQ PICTURE Z(9).

PROCEDURE DIVISION.
        OPEN INPUT STANDARD-INPUT, OUTPUT STANDARD-OUTPUT.
        PERFORM PRINT-HEADER.
        PERFORM TRANSLATE
            UNTIL EOF IS EQUAL 1.
        CLOSE STANDARD-INPUT, STANDARD-OUTPUT. 
        STOP RUN.

PRINT-HEADER.
        WRITE STDOUT-RECORD FROM TITLE-LINE.
        WRITE STDOUT-RECORD FROM UNDERLINE-1.
        WRITE STDOUT-RECORD FROM COL-HEADS.
        WRITE STDOUT-RECORD FROM UNDERLINE-2.

TRANSLATE.
        PERFORM GET-ROMAN.
        PERFORM COMPUTE-ROMAN-LEN.
        CALL "conv" USING ROMAN, ROMAN-LEN, ERR, RESULT.
        IF ERR IS EQUAL 2
            MOVE ROMAN TO ERROR-VAL
            WRITE STDOUT-RECORD FROM ERROR-MSG
        ELSE
            MOVE RESULT TO OUT-EQ
            MOVE ROMAN TO OUT-R
            WRITE STDOUT-RECORD FROM PRINT-LINE.

GET-ROMAN.
        MOVE SPACES TO ROMAN.
        WRITE STDOUT-RECORD FROM '>' AFTER ADVANCING 0 LINES.
        READ STANDARD-INPUT INTO ROMAN
            AT END MOVE 1 TO EOF.

COMPUTE-ROMAN-LEN.
        MOVE 0 TO ROMAN-LEN.
        INSPECT FUNCTION REVERSE(ROMAN) TALLYING ROMAN-LEN FOR LEADING SPACES.
        COMPUTE ROMAN-LEN = LENGTH OF ROMAN - ROMAN-LEN.
